In [1]:
import numpy as np
import pandas as pd

In [6]:
team_data={'Company': ['Apple','FB','Google','FB','Apple','Google'],
           'Person' : ['Tom','Maria','Sia','Mark','John','Emma'],
           'Sale':[200,300,240,260,210,120]}

In [9]:
team_data

{'Company': ['Apple', 'FB', 'Google', 'FB', 'Apple', 'Google'],
 'Person': ['Tom', 'Maria', 'Sia', 'Mark', 'John', 'Emma'],
 'Sale': [200, 300, 240, 260, 210, 120]}

In [7]:
df=pd.DataFrame(team_data)

In [10]:
df

  Company Person  Sale
0   Apple    Tom   200
1      FB  Maria   300
2  Google    Sia   240
3      FB   Mark   260
4   Apple   John   210
5  Google   Emma   120

In [16]:
df.groupby('Company')

In [ ]:
df.groupby(by='Company')

In [17]:
l=df.groupby('Company')

In [20]:
l.sum()

         Sale
Company
Apple     410
FB        560
Google    360

In [21]:
l.std()

              Sale
Company
Apple     7.071068
FB       28.284271
Google   84.852814

In [22]:
l.sum().loc['Apple']

Sale    410
Name: Apple, dtype: int64

In [23]:
df.groupby('Company').sum()

         Sale
Company
Apple     410
FB        560
Google    360

In [24]:
# Group by method with describe
df.groupby('Company').describe()

         Sale
        count   mean        std    min    25%    50%    75%    max
Company
Apple     2.0  205.0   7.071068  200.0  202.5  205.0  207.5  210.0
FB        2.0  280.0  28.284271  260.0  270.0  280.0  290.0  300.0
Google    2.0  180.0  84.852814  120.0  150.0  180.0  210.0  240.0

In [25]:
# Group by method with describe
df.groupby('Company').describe().T

Company          Apple          FB      Google
Sale count    2.000000    2.000000    2.000000
     mean   205.000000  280.000000  180.000000
     std      7.071068   28.284271   84.852814
     min    200.000000  260.000000  120.000000
     25%    202.500000  270.000000  150.000000
     50%    205.000000  280.000000  180.000000
     75%    207.500000  290.000000  210.000000
     max    210.000000  300.000000  240.000000

In [26]:
# Group by method with describe
df.groupby('Company').describe().loc['Apple']

Sale  count      2.000000
      mean     205.000000
      std        7.071068
      min      200.000000
      25%      202.500000
      50%      205.000000
      75%      207.500000
      max      210.000000
Name: Apple, dtype: float64

In [27]:
d={'A':[1,2,np.nan],
  'B':[3,np.nan,np.nan],
  'C':[4,5,6]}

In [28]:
d

{'A': [1, 2, nan], 'B': [3, nan, nan], 'C': [4, 5, 6]}

In [29]:
df1=pd.DataFrame(d)

In [30]:
df1

     A    B  C
0  1.0  3.0  4
1  2.0  NaN  5
2  NaN  NaN  6

In [32]:
# dropna method
'''Bydefaut,axis=0 means Any row having any one column with null value gets dropped
i.e. those row will drop which contain any one Nan'''
df1.dropna()

     A    B  C
0  1.0  3.0  4

In [34]:
# dropna method
'''If axis=1 means column for any row  with null value gets dropped
i.e. those columns will drop which contain any one Nan '''
df1.dropna(axis=1)

   C
0  4
1  5
2  6

In [36]:
df1

     A    B  C
0  1.0  3.0  4
1  2.0  NaN  5
2  NaN  NaN  6

In [37]:
'''At most two non nan value are there in any row'''
df1.dropna(thresh=2)

     A    B  C
0  1.0  3.0  4
1  2.0  NaN  5

In [39]:
df1

     A    B  C
0  1.0  3.0  4
1  2.0  NaN  5
2  NaN  NaN  6

In [41]:
'''At least two non nan value are there in any column(axis=1)'''
df1.dropna(thresh=2,axis=1)

     A  C
0  1.0  4
1  2.0  5
2  NaN  6

In [42]:
'''At least 1 non nan value are there in any column(axis=1)'''
df1.dropna(thresh=1)

     A    B  C
0  1.0  3.0  4
1  2.0  NaN  5
2  NaN  NaN  6

In [44]:
'''At least 1 non nan value are there in any column(axis=1)'''
df1.dropna(thresh=1,axis=1)

     A    B  C
0  1.0  3.0  4
1  2.0  NaN  5
2  NaN  NaN  6

In [45]:
df1

     A    B  C
0  1.0  3.0  4
1  2.0  NaN  5
2  NaN  NaN  6

In [46]:
# fillNa method
'''Replace all Nan Value'''
df1.fillna(value='New Value')

           A          B  C
0          1          3  4
1          2  New Value  5
2  New Value  New Value  6

In [49]:
df1

     A    B  C
0  1.0  3.0  4
1  2.0  NaN  5
2  NaN  NaN  6

In [48]:
'''Add mean of a column in place of NaN'''
df1['A'].fillna(value=df1['A'].mean())

'''Mean are always calculated on Non Null Value'''

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [ ]:
###Merging Joining and Concatenating DF